[
    {
        "title": "HI, I'M JOE!",
        "items": [
            {
                "title": "Software Developer",
                "description": "I like making things that work well, help solve a problem, and are fun to use. Whether it's a fun little video game or a custom AI assistant, I build things that are meant to be used, not just looked at.",
                "type": "text"
            },
            {
                "title": "Graphic Designer",
                "description": "My background is in design: graphic design, 3D modeling, texture work, and interface design. That’s how I learned to solve problems visually and care about how things feel, not just how they function.",
                "type": "text"
            },
            {
                "title": "Computer Science Student",
                "description": "Currently at WGU, filling in my knowledge gaps. I’ve always been self-taught but I wanted to formalize my learning and push myself even farther. Looking for a software development internship while I study.",
                "type": "text"
            },
            {
                "title": "Disc Golf Enjoyer",
                "description": "There’s something perfect about chasing a flying disc through the woods. It’s quiet, cheap, social, and slightly competitive, like debugging, but with trees.",
                "type": "text"
            },
            {
                "title": "AI Enthusiast",
                "description": "I'm experimenting with ai, voice interfaces, and personal tooling. There's so much potential and I am working hard to see what useful systems I can build for myself and others. ",
                "type": "text"
            },
            {
                "title": "Creative Problem Solver",
                "description": "I like figuring things out. Whether it's a puzzle or a piece of software. I’m drawn to what doesn’t have an obvious solution yet.",
                "type": "text"
            },
            {
                "title": "User Focused Creator",
                "description": "I care about how things feel to use. Design and code aren’t separate for me. While I believe in the concept of 'form follows function' I also believe that form is just as important as function. What good is a toll if a user doesn't want to use it?",
                "type": "text"
            },
            {
                "title": "Collaborative Builder",
                "description": "I’ve worked solo and with teams. I like both, but I’ve learned that a lot more is possible when you are working together. Plus, struggling on bugs together is more fun, and easier, than struggling alone.",
                "type": "text"
            },
            {
                "title": "Forever in Progress",
                "description": "This is how I live my life. I never want to stop learning and being a better version of myself. There's always something new to learn, something new to try, and something new to build. I'm always in progress.",
                "type": "text"
            }
        ]
    },
    {
        "title": "I'M WORKING ON",
        "items": [{
                "title": "Personal Life Assistant",
                "description": "A voice powered personal assistant that helps you manage your tasks and schedules. It runs locally, handles task management, and connects to my other tools. Built with Python, Flask, and Godot, and designed with privacy in mind.<br> <a href='https://github.com/joe-gutman/personal-assistant-desktop-server'>Check it out on GitHub</a>",
                "type": "project"
            },
            {
                "title": "Skiing Video Game",
                "description": "Building a simple video game as a dive into game developement. Crafting an homage to a game I remember playing fondly as a kid, Ski Free by Chris Pirih. Adding my own twist on the gameplay and design to make it my own. <br> <a href='https://github.com/joe-gutman/skiing-video-game'>Check it out on GitHub</a>",
                "type": "project"
            }
        ]
    },
    {
        "title": "I'VE WORKED ON",
        "items": [
            {
                "title": "Table Top Tracker",
                "description": "A student group project during my time in the Hack Reactor bootcamp. We built a full-stack app for organizing board game collections and getting AI-powered game recommendations. I led the team of eight of us, coordinated front-end and back-end development, and helped guide the UX from idea to implementation. <br> <a href='https://github.com/joe-gutman/table-top-tracker'>Check it out on GitHub</a>",
                "type": "project"
            }
        ]
    }
]